from unittest.mock import patch

import pandas as pd

from src.utils import xlsx_reader


def test_excel_reader() -> None:
    with patch("pandas.read_excel") as mock_excel:
        mock_excel.return_value = pd.DataFrame(
            {
                "Дата операции": ["29.12.2021 22:32:24"],
                "Дата платежа": ["30.12.2021"],
                "Номер карты": ["*4556"],
                "Статус": ["OK"],
                "Сумма операции": [-1411.4],
                "Валюта операции": ["RUB"],
                "Сумма платежа": [-1411.4],
                "Валюта платежа": ["RUB"],
                "Кэшбэк": [70.0],
                "Категория": ["Ж/д билеты"],
                "MCC": [4112.0],
                "Описание": ["РЖД"],
                "Бонусы (включая кэшбэк)": [70],
                "Округление на инвесткопилку": [0],
                "Сумма операции с округлением": [1411.4],
            },
            index=["row1"],
        )
        data = xlsx_reader("../data/operations.xls")
        assert {
            "Дата операции": "29.12.2021 22:32:24",
            "Дата платежа": "30.12.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -1411.4,
            "Валюта операции": "RUB",
            "Сумма платежа": -1411.4,
            "Валюта платежа": "RUB",
            "Кэшбэк": 70.0,
            "Категория": "Ж/д билеты",
            "MCC": 4112.0,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 70,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1411.4,
        } in data


def test_wrong_path() -> None:
    excel_data = xlsx_reader("test.xls")
    assert excel_data == []
